app/controllers/device_profiles_controller.rb

SELECT * FROM `device_profiles` WHERE (`device_profiles`.`id` = 949953652)
---
  def show
    @device_profile = DeviceProfile.find(params[:id])

SELECT * FROM `device_profiles` WHERE (`device_profiles`.`id` = 949953652)
---
  def edit
    @device_profile = DeviceProfile.find(params[:id])

INSERT INTO `device_profiles` (`name`, `mobile_asset`, `updated_at`, `description`, `created_at`) VALUES('Test profile.....', 0, '2009-02-25 21:19:26', NULL, '2009-02-25 21:19:26')
---
  def create
    @device_profile = DeviceProfile.new(params[:device_profile])

    respond_to do |format|
      if @device_profile.save

SELECT * FROM `device_profiles` WHERE (`device_profiles`.`id` = 949953652)
UPDATE `device_profiles` SET `mobile_asset` = 1, `description` = 'Test', `updated_at` = '2009-02-25 21:21:09' WHERE `id` = 949953652
---
  def update
    @device_profile = DeviceProfile.find(params[:id])

    respond_to do |format|
      if @device_profile.update_attributes(params[:device_profile])